src/cf/Catalogs/ПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИдентификаторыОбъектовМетаданных</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПечатныеФормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плагин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Плагины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняемыйМодуль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьБезПросмотра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭкземпляров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПараметрыПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПечатныеФормы/Forms/ФормаПечати/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	стрИмя=Команда.Имя;
	Если стрИмя="ОтправитьПоПочте" Тогда
		//УправлениеОтчетами.ОтправитьДокументПоЭлектроннойПочте(Таб, Заголовок, Объект.ОбъектПечати);

	ИначеЕсли стрИмя="Печать" Тогда
		Таб.КоличествоЭкземпляров=КоличествоЭкземпляров;
		Если ЗначениеЗаполнено(стрТипДвустороннейПечати) Тогда
			Таб.ДвусторонняяПечать=ТипДвустороннейПечати[стрТипДвустороннейПечати];
		КонецЕсли;		
		Таб.Напечатать(Истина);
		//ЭтаФорма.Закрыть();

	ИначеЕсли стрИмя="Поделиться" Тогда
		ОткрытьФорму("РегистрСведений.Share.Форма.ФормаЗаписи",Новый Структура("ТабличныйДокумент", Таб),,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ИначеЕсли стрИмя="Сохранить" Тогда
	//	Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	//	Диалог.Заголовок="Сохранить как";
	//	Диалог.ПолноеИмяФайла=СтрЗаменить(ЭтаФорма.Заголовок, ".", "_");
	//	Диалог.ПредварительныйПросмотр=Ложь;
	//	Диалог.Фильтр="Табличный документ (*.mxl)|*.mxl|"+"Документ Microsoft Excel (*.xls)|*.xls|";
	//	//Диалог.Показать(О
	//	Если Не Диалог.Выбрать() Тогда Возврат; КонецЕсли; 

	//	ИмяФайла=Диалог.ПолноеИмяФайла;
	//	Попытка Таб.Записать(ИмяФайла, ?(Прав(ИмяФайла,3) = "xls", ТипФайлаТабличногоДокумента.XLS, ТипФайлаТабличногоДокумента.MXL));
	//	Исключение ПоказатьПредупреждение(, "Ошибка при записи. Файл не записан.");
	//	КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="КоличествоЭкземпляров" Тогда
		Таб.КоличествоЭкземпляров=КоличествоЭкземпляров;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПечатныйДокумент=Неопределено; Параметры.Свойство("ПечатныйДокумент", ПечатныйДокумент);
	ОбъектПечати=Неопределено; Параметры.Свойство("ОбъектПечати", ОбъектПечати);
	Параметры.Свойство("КоличествоЭкземпляров", КоличествоЭкземпляров);
	Параметры.Свойство("НаПринтер", НаПринтер);
	Параметры.Свойство("ПараметрыПечатнойФормы", ПараметрыПечатнойФормы);

	Если КоличествоЭкземпляров=0 Тогда
		КоличествоЭкземпляров=1;
	КонецЕсли;

	Заголовок=СокрЛП(ОбъектПечати);	
	ЗаполнитьЗначенияСвойств(Таб, ПечатныйДокумент,,"Области");

	Таб.ВставитьОбласть(ПечатныйДокумент.Область());
	Таб.Защита=УправлениеПользователямиСервер.ЗащитаТаблиц();
	Таб.КоличествоЭкземпляров=КоличествоЭкземпляров;

	Для каждого СтрокаКоллекции Из ПараметрыПечатнойФормы Цикл
		Если СтрокаКоллекции.Ключ="ДвусторонняяПечать" Тогда
			Если ЗначениеЗаполнено(СтрокаКоллекции.Значение) Тогда
				стрТипДвустороннейПечати=СтрокаКоллекции.Значение; //***
				Таб[СтрокаКоллекции.Ключ]=ТипДвустороннейПечати[СтрокаКоллекции.Значение];
			КонецЕсли;

		ИначеЕсли СтрокаКоллекции.Ключ="АвтоМасштаб" Или СтрокаКоллекции.Ключ="МасштабПечати" Или СтрокаКоллекции.Ключ="ИспользуемоеИмяФайла" Или СтрокаКоллекции.Ключ="ИмяПринтера" Тогда
			Если ЗначениеЗаполнено(СтрокаКоллекции.Значение) Тогда
				Таб[СтрокаКоллекции.Ключ]=СтрокаКоллекции.Значение;
			КонецЕсли;

		ИначеЕсли СтрокаКоллекции.Ключ="ОриентацияСтраницы" Тогда
			Если ЗначениеЗаполнено(СтрокаКоллекции.Значение) Тогда
				Таб[СтрокаКоллекции.Ключ]=ОриентацияСтраницы[СтрокаКоллекции.Значение];
			КонецЕсли;
		Иначе
			Таб[СтрокаКоллекции.Ключ]=СтрокаКоллекции.Значение;			
		КонецЕсли;
	КонецЦикла;

	Если НаПринтер Тогда
		Таб.Вывод=ИспользованиеВывода.Разрешить;
		Таб.Напечатать(); Отказ=Истина; Возврат;
	КонецЕсли;

	Если НЕ ПараметрыПечатнойФормы.Количество()=0 Тогда
		ЗаполнитьЗначенияСвойств(Элементы.ПолеТабличногоДокумента, Таб);
	КонецЕсли;	
КонецПроцедуры
